# GetRequesters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingTooltipInfo..::..GetRequesters Method
WorksharingTooltipInfo Class See Also
---
The ordered list of unique user names of users who have outstanding editing requests for the specified element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<string> GetRequesters()
```

Visual Basic
---
```text
Public Function GetRequesters As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetRequesters()
```

# ### Return Value
The ordered list of unique user names.
# Remarks
The list is ordered by who placed the earliest request. If the list is empty it means that nobody is currently requesting the specified element.
# See Also
WorksharingTooltipInfo Class
Autodesk.Revit.DB Namespace